---
title: BuildingEnvelopeAnalyzerOptions
classe: Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# BuildingEnvelopeAnalyzerOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AnalyzeEnclosedSpaceVolumes { get; set; }` | `buildingEnvelopeAnalyzerOptions.AnalyzeEnclosedSpaceVolumes` | Boolean |
| `Double GridCellSize { get; set; }` | `buildingEnvelopeAnalyzerOptions.GridCellSize` | Double |
| `Boolean IsValidObject { get; }` | `buildingEnvelopeAnalyzerOptions.IsValidObject` | Boolean |
| `Boolean OptimizeGridCellSize { get; set; }` | `buildingEnvelopeAnalyzerOptions.OptimizeGridCellSize` | Boolean |
| `Void Dispose()` | `buildingEnvelopeAnalyzerOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```